Repository: aifraenkel/artist_finance_manager
Catalog: lib/l10n/app_*.arb
Languages: es

source: Income
es: Ingresos

source: Expenses
es: Gastos

source: Balance
es: Saldo

source: Projects
es: Proyectos

source: Dashboard
es: Panel

source: Profile
es: Perfil

source: Settings
es: Configuración

source: Sign Out
es: Cerrar sesión

source: Sign In
es: Iniciar sesión

source: Email
es: Correo electrónico

source: Password
es: Contraseña

source: Name
es: Nombre

source: Cancel
es: Cancelar

source: Save
es: Guardar

source: Delete
es: Eliminar

source: Edit
es: Editar

source: Add
es: Agregar

source: Loading
es: Cargando

source: Preferences
es: Preferencias

source: Language
es: Idioma

source: Currency
es: Moneda

source: Update Currency
es: Actualizar moneda

source: Change Currency
es: Cambiar moneda

source: Budget Goal
es: Objetivo de presupuesto

# profileAndSettings
source: Profile & Settings
es: Perfil y configuración

source: Add Transaction
es: Agregar transacción

source: Transaction History
es: Historial de transacciones

# noTransactionsYet
source: No transactions yet. Add your first one above!
es: Aún no hay transacciones. ¡Agrega tu primera arriba!

source: View Analytics
es: Ver análisis

source: Create Project
es: Crear proyecto

source: Amount
es: Monto

source: Description
es: Descripción

source: Category
es: Categoría

source: Select category
es: Seleccionar categoría

source: Expense
es: Gasto

# incomeType
source: Income
es: Ingreso

source: Type
es: Tipo

source: Venue
es: Lugar

source: Musicians
es: Músicos

# foodAndDrinks
source: Food & Drinks
es: Comida y bebidas

source: Materials/Clothes
es: Materiales/Ropa

source: Book Printing
es: Impresión de libros

source: Other
es: Otro

source: Book Sales
es: Ventas de libros

source: Event Tickets
es: Entradas para eventos

source: Delete Transaction
es: Eliminar transacción

# deleteTransactionConfirm
source: Are you sure you want to delete this transaction?
es: ¿Estás seguro de que deseas eliminar esta transacción?

source: Rename Project
es: Renombrar proyecto

source: Rename
es: Renombrar

source: Delete Project
es: Eliminar proyecto

# deleteProjectConfirm
source: Are you sure you want to delete this project?
es: ¿Estás seguro de que deseas eliminar este proyecto?

source: Create
es: Crear

source: Create Account
es: Crear cuenta

source: Send Sign-In Link
es: Enviar enlace de inicio de sesión

source: Back to Login
es: Volver al inicio de sesión

source: Resend Email
es: Reenviar correo

source: Delete Account
es: Eliminar cuenta

# deleteAccountWarning
source: This action cannot be undone. Are you sure you want to delete your account?
es: Esta acción no se puede deshacer. ¿Estás seguro de que deseas eliminar tu cuenta?

# deleteAccountDetails
source: This will:
es: Esto hará:

# deleteAccountRemoveAccess
source: • Remove access to your account
es: • Eliminará el acceso a tu cuenta

# deleteAccountDeleteData
source: • Permanently delete all your data
es: • Borrará permanentemente todos tus datos

source: Analytics Dashboard
es: Panel de análisis

source: Analyze Goal
es: Analizar objetivo

# changeCurrencyWarning
source: Changing currency will convert all transaction amounts.
es: Cambiar la moneda convertirá todos los montos de las transacciones.

source: Accept
es: Aceptar

source: Essential Only
es: Solo esenciales

source: Total Income
es: Ingresos totales

source: Total Expenses
es: Gastos totales

# createProjectToStart
source: Create a project to start managing your finances
es: Crea un proyecto para empezar a gestionar tus finanzas

source: Project Name
es: Nombre del proyecto

source: Enter project name
es: Ingresa el nombre del proyecto

# projectNameTooLong
source: Project name must be at most 50 characters.
es: El nombre del proyecto debe tener como máximo 50 caracteres.

# projectCreatedSuccess
source: Project "$name" created
es: Proyecto "$name" creado

# failedToCreateProject
source: Failed to create project: $error
es: Error al crear proyecto: $error

# projectRenamedSuccess
source: Project renamed to "$name"
es: Proyecto renombrado a "$name"

# failedToRenameProject
source: Failed to rename project: $error
es: Error al renombrar proyecto: $error

# deleteProjectWarning
source: Are you sure you want to delete "$name"? All transactions for this project will be lost. This action cannot be undone.
es: ¿Estás seguro de que deseas eliminar "$name"? Todas las transacciones de este proyecto se perderán. Esta acción no se puede deshacer.

# projectDeletedSuccess
source: Project "$name" deleted
es: Proyecto "$name" eliminado

# failedToDeleteProject
source: Failed to delete project: $error
es: Error al eliminar proyecto: $error

source: No data available
es: No hay datos disponibles

# addTransactionsToSeeAnalytics
source: Add some transactions to see analytics
es: Agrega algunas transacciones para ver el análisis

source: Failed to load user preferences
es: Error al cargar las preferencias del usuario

# profileUpdatedSuccess
source: Profile updated successfully
es: Perfil actualizado correctamente

source: Failed to update profile
es: Error al actualizar el perfil

# signOutConfirm
source: Are you sure you want to sign out?
es: ¿Estás seguro de que deseas cerrar sesión?

# deleteAccountKeepData
source: • Keep your data for 90 days in case you change your mind
es: • Guardaremos tus datos durante 90 días por si cambias de opinión

# recoverAccountInfo
source: You can recover your account within 90 days by signing in again
es: Puedes recuperar tu cuenta dentro de los 90 días iniciando sesión nuevamente

source: Failed to delete account
es: Error al eliminar la cuenta

# projectsExportedSuccess
source: Projects exported successfully
es: Proyectos exportados correctamente

source: Failed to export
es: Error al exportar

source: Budget goal cleared
es: Objetivo de presupuesto eliminado

# budgetGoalSavedSuccess
source: Budget goal saved successfully
es: Objetivo de presupuesto guardado correctamente

source: OpenAI API key cleared
es: Clave API de OpenAI eliminada

# openaiApiKeySavedSuccess
source: OpenAI API key saved successfully
es: Clave API de OpenAI guardada correctamente

source: Failed to save API key
es: Error al guardar la clave API

source: Language updated to
es: Idioma actualizado a

source: Failed to update language
es: Error al actualizar el idioma

# currencyChangeDescription
source: will update the currency symbol displayed in the app.
es: actualizará el símbolo de moneda que se muestra en la aplicación.

# currencyRateInfo
source: The conversion rate from the European Central Bank (via Frankfurter API) will be fetched and stored for your reference.
es: La tasa de conversión del Banco Central Europeo (a través de la API de Frankfurter) se obtendrá y almacenará para su referencia.

# noteNoConvertExistingAmounts
source: Note: This does not convert existing transaction amounts
es: Nota: Esto no convierte los montos de transacciones existentes

# currencyUpdatedWithRate
source: Currency updated to
es: Moneda actualizada a

source: Failed to update currency
es: Error al actualizar la moneda

source: Please enter your name
es: Por favor ingresa tu nombre

# nameMinimumLength
source: Name must be at least 2 characters
es: El nombre debe tener al menos 2 caracteres

source: Edit Profile
es: Editar perfil

source: Account Information
es: Información de la cuenta

source: Member since
es: Miembro desde

source: Last login
es: Último inicio de sesión

source: Login count
es: Número de inicios de sesión

# privacyAndData
source: Privacy & Data
es: Privacidad y datos

source: Analytics
es: Análisis

# analyticsHelperText
source: Help improve the app by sharing anonymous usage data
es: Ayuda a mejorar la aplicación compartiendo datos de uso anónimos

source: Analytics enabled - thank you!
es: Análisis activado - ¡gracias!

source: Analytics disabled
es: Análisis desactivado

source: What data do we collect?
es: ¿Qué datos recopilamos?

source: Financial Goal
es: Objetivo financiero

# financialGoalHint
source: e.g., I want to have a positive balance of 200€ per month
es: ej., Quiero tener un saldo positivo de 200€ por mes

# financialGoalHelper
source: Describe your financial goal in natural language
es: Describe tu objetivo financiero en lenguaje natural

source: Goal Active
es: Objetivo activo

# goalActiveHelper
source: Activate goal to see analysis in dashboard
es: Activa el objetivo para ver el análisis en el panel

source: Save Goal
es: Guardar objetivo

source: No budget goal set
es: No se ha establecido ningún objetivo de presupuesto

source: Active
es: Activo

source: Inactive
es: Inactivo

source: Set Budget Goal
es: Establecer objetivo de presupuesto

source: Edit Budget Goal
es: Editar objetivo de presupuesto

source: OpenAI Configuration
es: Configuración de OpenAI

source: OpenAI API Key
es: Clave API de OpenAI

# openaiApiKeyHelper
source: Required for budget goal analysis. Get your key from platform.openai.com
es: Requerido para el análisis de objetivos de presupuesto. Obtén tu clave en platform.openai.com

# openaiApiKeySecurityInfo
source: Your API key is stored locally and never shared. It's used only for analyzing your budget goals.
es: Tu clave API se almacena localmente y nunca se comparte. Se utiliza solo para analizar tus objetivos de presupuesto.

source: Account Actions
es: Acciones de cuenta

source: Export to CSV
es: Exportar a CSV

source: Changing from
es: Cambiando de

# privacyAnalyticsTitle
source: Privacy & Analytics
es: Privacidad y analítica

# privacyAnalyticsIntro
source: Help us improve the app by sharing anonymous analytics data.
es: Ayúdanos a mejorar la app compartiendo datos de analítica anónimos.

# privacyAnalyticsCollect
source: What we collect:
es: Qué recopilamos:

# privacyCollectTransactions
source: Transaction events (add/delete/load)
es: Eventos de transacciones (agregar/eliminar/cargar)

# privacyCollectPerformance
source: Performance metrics (load times, Web Vitals)
es: Métricas de rendimiento (tiempos de carga, Web Vitals)

# privacyCollectErrors
source: Error tracking
es: Seguimiento de errores

# privacyCollectSessions
source: Session analytics
es: Analítica de sesiones

# privacyAnalyticsNoCollect
source: What we DON'T collect:
es: Qué NO recopilamos:

# privacyNoCollectAmounts
source: Transaction amounts
es: Montos de transacciones

# privacyNoCollectDescriptions
source: Transaction descriptions
es: Descripciones de transacciones

# privacyNoCollectPersonal
source: Personal financial data
es: Datos financieros personales

# privacyChangeAnytime
source: You can change this preference anytime in Settings.
es: Puedes cambiar esta preferencia en cualquier momento en Configuración.

source: Privacy Policy
es: Política de privacidad

# privacyPolicyCallout
source: Our Privacy Policy explains how we collect, use, and protect your data. Key points: • Analytics are disabled by default • We never track transaction amounts or descriptions • You control your privacy settings • You can delete your data anytime For the full privacy policy, please visit our GitHub repository: github.com/aifraenkel/artist_finance_manager/blob/main/PRIVACY.md
es: Nuestra Política de Privacidad explica cómo recopilamos, usamos y protegemos tus datos. Puntos clave: • La analítica está desactivada por defecto • Nunca rastreamos montos ni descripciones de transacciones • Tú controlas tus ajustes de privacidad • Puedes eliminar tus datos en cualquier momento Para ver la política completa, visita nuestro repositorio en GitHub: github.com/aifraenkel/artist_finance_manager/blob/main/PRIVACY.md

source: Close
es: Cerrar
